-- ----------------------------
-- Records of teacher
-- ----------------------------
INSERT INTO `teacher` VALUES ('1592222538613', '15923093716', '15923093716@qq.com', '0b2688dc3cc20929314baccadaa3d66b', '李毅', '两江人工智能学院', '1592224342563.png');
INSERT INTO `teacher` VALUES ('1592222568490', '18375630579', '18375630579@qq.com', 'b2e868723459c207e82620773d43283d', '蒋义城', '两江人工智能学院', NULL);
INSERT INTO `teacher` VALUES ('1592222598296', '18375923287', '18375923287@qq.com', '01a01598034b7336499cfd9b6fda0d3e', '赵丽伟', '两江人工智能学院', NULL);
INSERT INTO `teacher` VALUES ('1592222624513', '18375613175', '18375613175@qq.com', '2051ecaa704e9258c20eef55a02129a2', '韩健辉', '两江人工智能学院', NULL);

-- ----------------------------
-- Records of student
-- ----------------------------
INSERT INTO `student` VALUES ('1592222724658', '18375891382', '18375891382@qq.com', '73f1391d3cbd19033523d7026fc53930', '11823020201', '李春光', '两江人工智能学院', NULL);
INSERT INTO `student` VALUES ('1592222759475', '18375657613', '18375657613@qq.com', '50ed0928a4843329a6e6c45e03e82d46', '11823020202', '杨珂阳', '两江人工智能学院', NULL);
INSERT INTO `student` VALUES ('1592222792106', '18375853517', '18375853517@qq.com', '968d6484ba33bb86b36065bd9a84e6ab', '11823020203', '许子文', '两江人工智能学院', NULL);
INSERT INTO `student` VALUES ('1592222819326', '18375619285', '18375619285@qq.com', 'cce21a520e0e3fcdfa8f4dca9bb5341c', '11823020204', '吕安邦', '两江人工智能学院', NULL);
INSERT INTO `student` VALUES ('1592222854356', '18375868053', '18375868053@qq.com', 'c31ee83ed6c8951e2a871d4b12b27e2f', '11823020205', '赵斌', '两江人工智能学院', NULL);
INSERT INTO `student` VALUES ('1592222881273', '15923082915', '15923082915@qq.com', '4a9dba600b66df3f03736e207decb05c', '11823020206', '马俊一', '两江人工智能学院', NULL);
INSERT INTO `student` VALUES ('1592223058459', '15923927362', '15923927362@qq.com', 'd55d2290a3bca010fcc875289b6c171f', '11823020207', '孔健', '两江人工智能学院', NULL);
INSERT INTO `student` VALUES ('1592223150689', '18306057207', '18306057207@qq.com', '2bbaef86cb4907ca791c1a8b77fda7a2', '11823020209', '蒋轩海', '两江人工智能学院', NULL);
INSERT INTO `student` VALUES ('1592223217450', '18375699560', '18375699560@qq.com', '9cd3dc2a855e41020ce64e24b50076f9', '11823020210', '施英博', '两江人工智能学院', NULL);
INSERT INTO `student` VALUES ('1592223319706', '18375722610', '18375722610@qq.com', 'b0475b5dab6ad95994595c131c2afcd8', '11823020208', '苗文兵', '两江人工智能学院', NULL);

-- ----------------------------
-- Records of course
-- ----------------------------
INSERT INTO `course` VALUES ('1592224548669', '1592222538613', '高级java', '2019-2020', 3, '14A64E4O', 0);

-- ----------------------------
-- Records of tc
-- ----------------------------
INSERT INTO `tc` VALUES ('756962613549357', '1592222568490', '1592224548669', 0, 1, 1);
INSERT INTO `tc` VALUES ('962861538958083', '1592222538613', '1592224548669', 0, 0, 0);

-- ----------------------------
-- Records of sc
-- ----------------------------
INSERT INTO `sc` VALUES ('347269669074534', '1592222724658', '1592224548669', -1, 1, 0);

-- ----------------------------
-- Records of twork
-- ----------------------------
INSERT INTO `twork` VALUES ('1592225654112', '1592222538613', '1592224548669', '同学们好，', '## 这门课程难吗？  \n下面的输出结果是什么？  \n```java  \n\n    int i = 0;  \n    System.out.println(i+1)  \n\n```  \n\n| 左对齐 | 右对齐 | 居中对齐 |  \n| :-----| ----: | :----: |  \n| 单元格 | 单元格 | 单元格 |  \n| 单元格 | 单元格 | 单元格 |', '2020-06-10', '2020-06-18', 0.11);

-- ----------------------------
-- Records of swork
-- ----------------------------
INSERT INTO `swork` VALUES ('1592226588065', '1592225654112', '1592222724658', '这门课非常easy  \n哈哈  \n```javascript  \nalert(\"哈哈\")\n```', '2020-06-15', 1, 0, '不错');

-- ----------------------------
-- Records of message
-- ----------------------------
INSERT INTO `message` VALUES ('1592225461653', '1592224548669', '新增作业', '作业名：同学们好，;作业内容：请查看详情；截止时间：2020-06-18', '2020-06-15', -1);


-- ----------------------------
-- Records of sm
-- ----------------------------
